# Assignment 1

Ques 1 : Create a dataset as table.

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

Ques 2 : From the above table that you have created, locate row 0, 4, 7 and 8 using DataFrame.

In [3]:
import pandas as pd

df=pd.read_csv('/content/drive/MyDrive/table.csv')
print(df.iloc[0])
print(df.iloc[4])
print(df.iloc[7])
print(df.iloc[8])

Tid                    1
Refund               Yes
Marital Status    Single
Taxable Income    125000
Cheat                 No
Name: 0, dtype: object
Tid                      5
Refund                  No
Marital Status    Divorced
Taxable Income       95000
Cheat                  Yes
Name: 4, dtype: object
Tid                    8
Refund                No
Marital Status    Single
Taxable Income     85000
Cheat                Yes
Name: 7, dtype: object
Tid                     9
Refund                 No
Marital Status    Married
Taxable Income      75000
Cheat                  No
Name: 8, dtype: object

Ques 3 : Navigate the DataFrame and do the following task for the table created in question 1:
1. Select row from index 3 to 7.
2. Select row from index 4 to 8, and column 2 to 4.
3. Select all rows with column index 1 to 3 (include index 3 during selection).

In [4]:
print(df.iloc[3:7])
print(df.iloc[4:8,2:4])
print(df.iloc[:,1:4])

   Tid Refund Marital Status  Taxable Income Cheat
3    4    Yes        Married          120000    No
4    5     No       Divorced           95000   Yes
5    6     No        Married           60000    No
6    7    Yes       Divorced          220000    No
  Marital Status  Taxable Income
4       Divorced           95000
5        Married           60000
6       Divorced          220000
7         Single           85000
  Refund Marital Status  Taxable Income
0    Yes         Single          125000
1     No        Married          100000
2     No         Single           70000
3    Yes        Married          120000
4     No       Divorced           95000
5     No        Married           60000
6    Yes       Divorced          220000
7     No         Single           85000
8     No        Married           75000
9     No         Single           90000

Ques 4 : Read a csv file and display its first five rows.

In [34]:
import pandas as pp
df=pp.read_csv('/Iris.csv')
print(df)
df.head()

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  \
0      1            5.1           3.5            1.4           0.2
1      2            4.9           3.0            1.4           0.2
2      3            4.7           3.2            1.3           0.2
3      4            4.6           3.1            1.5           0.2
4      5            5.0           3.6            1.4           0.2
..   ...            ...           ...            ...           ...
145  146            6.7           3.0            5.2           2.3
146  147            6.3           2.5            5.0           1.9
147  148            6.5           3.0            5.2           2.0
148  149            6.2           3.4            5.4           2.3
149  150            5.9           3.0            5.1           1.8

            Species
0       Iris-setosa
1       Iris-setosa
2       Iris-setosa
3       Iris-setosa
4       Iris-setosa
..              ...
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

[150 rows x 6 columns]

Ques 5 : From the csv file (uploaded in the Q.4) delete row 4, and delete column 3. Display the
result.

In [35]:
print(df)
df.drop(3,axis=0,inplace=True)
print(df)
df.drop(df.columns[2],axis=1,inplace=True)
print(df)

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  \
0      1            5.1           3.5            1.4           0.2
1      2            4.9           3.0            1.4           0.2
2      3            4.7           3.2            1.3           0.2
3      4            4.6           3.1            1.5           0.2
4      5            5.0           3.6            1.4           0.2
..   ...            ...           ...            ...           ...
145  146            6.7           3.0            5.2           2.3
146  147            6.3           2.5            5.0           1.9
147  148            6.5           3.0            5.2           2.0
148  149            6.2           3.4            5.4           2.3
149  150            5.9           3.0            5.1           1.8

            Species
0       Iris-setosa
1       Iris-setosa
2       Iris-setosa
3       Iris-setosa
4       Iris-setosa
..              ...
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

[150 rows x 6 columns]
      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  \
0      1            5.1           3.5            1.4           0.2
1      2            4.9           3.0            1.4           0.2
2      3            4.7           3.2            1.3           0.2
4      5            5.0           3.6            1.4           0.2
5      6            5.4           3.9            1.7           0.4
..   ...            ...           ...            ...           ...
145  146            6.7           3.0            5.2           2.3
146  147            6.3           2.5            5.0           1.9
147  148            6.5           3.0            5.2           2.0
148  149            6.2           3.4            5.4           2.3
149  150            5.9           3.0            5.1           1.8

            Species
0       Iris-setosa
1       Iris-setosa
2       Iris-setosa
4       Iris-setosa
5       Iris-setosa
..              ...
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

[149 rows x 6 columns]
      Id  SepalLengthCm  PetalLengthCm  PetalWidthCm         Species
0      1            5.1            1.4           0.2     Iris-setosa
1      2            4.9            1.4           0.2     Iris-setosa
2      3            4.7            1.3           0.2     Iris-setosa
4      5            5.0            1.4           0.2     Iris-setosa
5      6            5.4            1.7           0.4     Iris-setosa
..   ...            ...            ...           ...             ...
145  146            6.7            5.2           2.3  Iris-virginica
146  147            6.3            5.0           1.9  Iris-virginica
147  148            6.5            5.2           2.0  Iris-virginica
148  149            6.2            5.4           2.3  Iris-virginica
149  150            5.9            5.1           1.8  Iris-virginica

[149 rows x 5 columns]

Ques 6 :Create a sample dataset (employees.csv) containing information about employees in
a company.

In [37]:
import pandas as pd

df=pd.read_csv('/content/emp_data.csv')
print(df)

   Employee_id     Name Department  Age  Salary  Years_of_experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   29   60000                   12

  Joining_date  Gender  Bonus  Rating
0    3/15/2020  female   5000     4.5
1    7/19/2017    male   7000     4.0
2     6/1/2013    male   6000     3.8
3    2/10/2021  female   4500     4.7
4   11/25/2010    male   5000     3.5

In [38]:
# 6(a)
print("Shape of the DataFrame:", df.shape)

Shape of the DataFrame: (5, 10)

In [39]:
# 6(b)
print("\nSummary of the DataFrame:",df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_id          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_experience  5 non-null      int64
 6   Joining_date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes

Summary of the DataFrame: None

In [40]:
# 6(c)
print("\nDescriptive Statistics:",df.describe())

Descriptive Statistics:        Employee_id        Age       Salary  Years_of_experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  32.200000  60000.00000             7.400000  5500.0
std       1.581139   5.449771   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  29.000000  60000.00000             8.000000  5000.0
75%     104.000000  34.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

In [41]:
# 6(d)
print("\nFirst 5 rows:")
print(df.head())

print("\nLast 3 rows:")
print(df.tail(3))

First 5 rows:
   Employee_id     Name Department  Age  Salary  Years_of_experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   29   60000                   12

  Joining_date  Gender  Bonus  Rating
0    3/15/2020  female   5000     4.5
1    7/19/2017    male   7000     4.0
2     6/1/2013    male   6000     3.8
3    2/10/2021  female   4500     4.7
4   11/25/2010    male   5000     3.5

Last 3 rows:
   Employee_id     Name Department  Age  Salary  Years_of_experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   29   60000                   12

  Joining_date  Gender  Bonus  Rating
2     6/1/2013    male   6000     3.8
3    2/10/2021  female   4500     4.7
4   11/25/2010    male   5000     3.5

In [42]:
# 6(e)-(i)
print("Average salary : ",df['Salary'].mean())

Average salary :  60000.0

In [45]:
# 6(e)-(ii)
print("Total bonus paid : ",df['Bonus'].sum())

Total bonus paid :  27500

In [46]:
# 6(e)-(iii)
print("Youngest employee age : ",df['Age'].min())

Youngest employee age :  28

In [48]:
# 6(e)-(iv)
print("Highest performance rating : ",df['Rating'].max())

Highest performance rating :  4.7

In [51]:
# 6(f)
new_df=df.sort_values(by='Salary',ascending=False)
print(new_df)

   Employee_id     Name Department  Age  Salary  Years_of_experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   29   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_date  Gender  Bonus  Rating
1    7/19/2017    male   7000     4.0
2     6/1/2013    male   6000     3.8
4   11/25/2010    male   5000     3.5
3    2/10/2021  female   4500     4.7
0    3/15/2020  female   5000     4.5

In [52]:
# 6(g)
def categorize_performance(Rating):
    if Rating >= 4.5:
        return "Excellent"
    elif Rating >= 4.0:
        return "Good"
    else:
        return "Average"

df['Performance'] = df['Rating'].apply(categorize_performance)
print(df)

   Employee_id     Name Department  Age  Salary  Years_of_experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   29   60000                   12

  Joining_date  Gender  Bonus  Rating Performance
0    3/15/2020  female   5000     4.5   Excellent
1    7/19/2017    male   7000     4.0        Good
2     6/1/2013    male   6000     3.8     Average
3    2/10/2021  female   4500     4.7   Excellent
4   11/25/2010    male   5000     3.5     Average

In [53]:
# 6(h)
miss_val=df.isnull().sum()
print(miss_val)

Employee_id            0
Name                   0
Department             0
Age                    0
Salary                 0
Years_of_experience    0
Joining_date           0
Gender                 0
Bonus                  0
Rating                 0
Performance            0
dtype: int64

In [57]:
# 6(i)
df.rename(columns={"Employee_id": "ID"}, inplace=True)
print(df)

    ID     Name Department  Age  Salary  Years_of_experience Joining_date  \
0  101    Alice         HR   29   50000                    4    3/15/2020
1  102      Bob         IT   34   70000                    8    7/19/2017
2  103  Charlie         IT   41   65000                   10     6/1/2013
3  104    Diana  Marketing   28   55000                    3    2/10/2021
4  105   Edward      Sales   29   60000                   12   11/25/2010

   Gender  Bonus  Rating Performance
0  female   5000     4.5   Excellent
1    male   7000     4.0        Good
2    male   6000     3.8     Average
3  female   4500     4.7   Excellent
4    male   5000     3.5     Average

In [59]:
# 6(j)-(i)
experienced_emp=df[df['Years_of_experience']>5]
print(experienced_emp)

    ID     Name Department  Age  Salary  Years_of_experience Joining_date  \
1  102      Bob         IT   34   70000                    8    7/19/2017
2  103  Charlie         IT   41   65000                   10     6/1/2013
4  105   Edward      Sales   29   60000                   12   11/25/2010

  Gender  Bonus  Rating Performance
1   male   7000     4.0        Good
2   male   6000     3.8     Average
4   male   5000     3.5     Average

In [60]:
# 6(j)-(ii)
IT_dept=df[df['Department']=='IT']
print(IT_dept)

    ID     Name Department  Age  Salary  Years_of_experience Joining_date  \
1  102      Bob         IT   34   70000                    8    7/19/2017
2  103  Charlie         IT   41   65000                   10     6/1/2013

  Gender  Bonus  Rating Performance
1   male   7000     4.0        Good
2   male   6000     3.8     Average

In [61]:
# 6(k)
df['Tax']=df['Salary']*0.1
print(df)

    ID     Name Department  Age  Salary  Years_of_experience Joining_date  \
0  101    Alice         HR   29   50000                    4    3/15/2020
1  102      Bob         IT   34   70000                    8    7/19/2017
2  103  Charlie         IT   41   65000                   10     6/1/2013
3  104    Diana  Marketing   28   55000                    3    2/10/2021
4  105   Edward      Sales   29   60000                   12   11/25/2010

   Gender  Bonus  Rating Performance     Tax
0  female   5000     4.5   Excellent  5000.0
1    male   7000     4.0        Good  7000.0
2    male   6000     3.8     Average  6500.0
3  female   4500     4.7   Excellent  5500.0
4    male   5000     3.5     Average  6000.0

In [62]:
# 6(l)
output_file = "modified_emp_data.csv"
df.to_csv(output_file, index=False)
print(f"Modified DataFrame saved to {output_file}")

Modified DataFrame saved to modified_emp_data.csv